ext_alsav_zup/Documents/ИзменениеПлановыхНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ИзменениеПлановыхНачислений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АЛСАВ_Печать_Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЛСАВ_Печать_СовокупнаяТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЛСАВ_Печать_СовокупнаяТарифнаяСтавкаПропись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СовокупнаяТарифнаяСтавка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ext_alsav_zup/CommonModules/УправлениеПечатью/Ext/Module.bsl
&Вместо("ЗаполнитьДанныеПечати")
Процедура АЛСАВ_ЗаполнитьДанныеПечати(ДанныеПечати, ОписаниеПолей, ИерархияПолей, Объекты, КодЯзыка)
	// Вставить содержимое метода. 
	
	Если ЛОЖЬ Тогда ДанныеПечати = Новый Соответствие; КонецЕсли;
	Если ЛОЖЬ Тогда Объекты = Новый Массив; КонецЕсли;   
	
	мДобавитьОбъекты = новый Массив;
	мУдалитьОбъекты = Новый Массив;
	Для Каждого об из Объекты Цикл
		Если (
				ТипЗнч(об) = Тип("ДокументСсылка.ИзменениеПлановыхНачислений") 
				ИЛИ ТипЗнч(об) = Тип("ДокументСсылка.КадровыйПереводСписком") 
			)
			
			И ДанныеПечати.Получить(об).Количество() > 0 Тогда
			
			
			Если ЛОЖЬ Тогда об = Документы.ИзменениеПлановыхНачислений.ПустаяСсылка(); КонецЕсли;
			мУдалитьОбъекты.Добавить(об);
			
			Для Каждого стр из об.Сотрудники Цикл    
				нОб = СыылкуВСтруктуру(об);           
				
				Если ЛОЖЬ Тогда нОб = новый Структура; КонецЕсли;
				
				нОб.Вставить("_НомерСтроки",стр.НомерСтроки);
				нОб.Вставить("_ДанныеПечати",ДанныеПечати.Получить(об));
				
				нОб.АЛСАВ_Печать_Сотрудник = стр.Сотрудник;
				мДобавитьОбъекты.Добавить(нОб);
			КонецЦикла;
		КонецЕсли;  
		
	КонецЦикла; 
	
	Для Каждого об из мУдалитьОбъекты Цикл
		Объекты.Удалить(Объекты.Найти(об));
	КонецЦикла;
	
	Для Каждого об из мДобавитьОбъекты Цикл
		нДанныеПечати = новый Соответствие;
		Для Каждого эл из об._ДанныеПечати Цикл
			нДанныеПечати.Вставить(эл.Ключ, эл.Значение);
		КонецЦикла;
		ДанныеПечати.Вставить(об,нДанныеПечати);
		Объекты.Добавить(об);
	КонецЦикла;
	
	Для Каждого об из Объекты Цикл
		Если ТипЗнч(об) = Тип("Структура") Тогда
			данныеДляОбъекта = ДанныеПечати.Получить(об);
			Если данныеДляОбъекта <> неопределено Тогда
				Если ЛОЖЬ Тогда данныеДляОбъекта = новый Соответствие; КонецЕсли;
				
				АЛСАВ_Печать_Сотрудник = данныеДляОбъекта.Получить("АЛСАВ_Печать_Сотрудник");
				Если АЛСАВ_Печать_Сотрудник <> неопределено Тогда
					Если НЕ ЗначениеЗаполнено(АЛСАВ_Печать_Сотрудник) Тогда
						данныеДляОбъекта["АЛСАВ_Печать_Сотрудник"] = об.Сотрудники[об._НомерСтроки - 1].Сотрудник;
					КонецЕсли;
				КонецЕсли;
				
				АЛСАВ_Печать_СотрудникДатаПеревода = данныеДляОбъекта.Получить("АЛСАВ_Печать_СотрудникДатаПеревода");
				Если АЛСАВ_Печать_СотрудникДатаПеревода <> неопределено Тогда
					Если НЕ ЗначениеЗаполнено(АЛСАВ_Печать_СотрудникДатаПеревода) Тогда
						данныеДляОбъекта["АЛСАВ_Печать_СотрудникДатаПеревода"] = об.Сотрудники[об._НомерСтроки - 1].ДатаНачала;
					КонецЕсли;
				КонецЕсли;
				
				АЛСАВ_Печать_СовокупнаяТарифнаяСтавка = данныеДляОбъекта.Получить("АЛСАВ_Печать_СовокупнаяТарифнаяСтавка");
				Если АЛСАВ_Печать_Сотрудник <> неопределено Тогда
					Если НЕ ЗначениеЗаполнено(АЛСАВ_Печать_СовокупнаяТарифнаяСтавка) Тогда
						данныеДляОбъекта["АЛСАВ_Печать_СовокупнаяТарифнаяСтавка"] = об.Сотрудники[об._НомерСтроки - 1].СовокупнаяТарифнаяСтавка;  
						данныеДляОбъекта["АЛСАВ_Печать_СовокупнаяТарифнаяСтавкаПропись"] = алсав_ОбзегоНазначения.СуммаПрописьюРубли(данныеДляОбъекта["АЛСАВ_Печать_СовокупнаяТарифнаяСтавка"]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////
	ПродолжитьВызов(ДанныеПечати, ОписаниеПолей, ИерархияПолей, Объекты, КодЯзыка);  
	//////////////////////////////////////////////////////////////////////////////
	
	 
КонецПроцедуры


Функция СыылкуВСтруктуру(ссылка)     
	резалт = новый Структура;
	резалт.Вставить("Ссылка",ссылка);
	Если ЛОЖЬ Тогда ссылка = Документы.ИзменениеПлановыхНачислений.ПустаяСсылка(); КонецЕсли;
	
	мета = ссылка.Метаданные();
	Для Каждого рек из мета.Реквизиты Цикл
		резалт.Вставить(рек.Имя,ссылка[рек.Имя]);
	КонецЦикла;
	
	Для Каждого рек из мета.ТабличныеЧасти Цикл
		резалт.Вставить(рек.Имя,ссылка[рек.Имя]);
	КонецЦикла;  
	
	Возврат резалт;
КонецФункции

&Вместо("СсылкиПоТипам")
Функция АЛСАВ_СсылкиПоТипам(Ссылки)
	СсылкиПоТипам = Новый Соответствие;
	
	Для Каждого Ссылка Из Ссылки Цикл
		Если ТипЗнч(Ссылка) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Тип = ТипЗнч(Ссылка);
		/// +++ АЛСАВ                          
		Если ЛОЖЬ Тогда Ссылка = новый Структура; КонецЕсли;
		Если Тип = Тип("Структура") И Ссылка.Свойство("Ссылка") <> Неопределено Тогда
			Тип = ТипЗнч(Ссылка.Ссылка);
		КонецЕсли;
		/// --- АЛСАВ 
		
		Если СсылкиПоТипам[Тип] = Неопределено Тогда
			СсылкиПоТипам[Тип] = Новый Массив;
		КонецЕсли;
		
		СсылкиПоТипам[Тип].Добавить(Ссылка);
	КонецЦикла;
	
	Возврат СсылкиПоТипам;КонецФункции

&Вместо("СкомпоноватьДанные")
Функция АЛСАВ_СкомпоноватьДанные(Параметры)
		// Вставить содержимое метода.        
		
		Объекты = Параметры.ИсточникиДанных;
		Параметры.ИсточникиДанных = Новый Массив;
		Для Каждого об из Объекты Цикл  
			Если ТипЗнч(об) = Тип("Структура") И об.Свойство("Ссылка") <> Неопределено Тогда
				Параметры.ИсточникиДанных.Добавить(об.Ссылка);
			Иначе
				Параметры.ИсточникиДанных.Добавить(об);
			КонецЕсли;
		КонецЦикла;
		
		Результат = ПродолжитьВызов(Параметры);
		Возврат Результат;
	КонецФункции

&Вместо("ИмяФайлаОфисногоДокумента")
Функция АЛСАВ_ИмяФайлаОфисногоДокумента(Знач ИмяФайла, Знач ПереводитьВТранслит)             
	
	/// +++ АЛСАВ                 
	об = ИмяФайла;
	Если ТипЗнч(об) = Тип("Структура") И об.Свойство("Ссылка") <> Неопределено  И об.Свойство("_НомерСтроки") <> Неопределено Тогда
		ИмяФайла = ""+об._НомерСтроки+"_"+об.Ссылка;		
	КонецЕсли;
	/// --- АЛСАВ
	
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
	
	ОжидаемыеРасширения = Новый Соответствие;
	ОжидаемыеРасширения.Вставить(".docx", Истина);
	ОжидаемыеРасширения.Вставить(".doc", Истина);
	ОжидаемыеРасширения.Вставить(".odt", Истина);
	ОжидаемыеРасширения.Вставить(".html", Истина);
	
	Файл = Новый Файл(ИмяФайла);
	Если ОжидаемыеРасширения[Файл.Расширение] = Неопределено Тогда
		ИмяФайла = ИмяФайла + ".docx";
	КонецЕсли;
	
	Если ПереводитьВТранслит Тогда
		ИмяФайла = СтроковыеФункции.СтрокаЛатиницей(ИмяФайла)
	КонецЕсли;
	
	Возврат ИмяФайла;
КонецФункции
